{
  "app": {
    "name": "Zapdesk",
    "short_description": "Permite a los usuarios finales dar propinas a los agentes de soporte con pagos de Bitcoin Lightning Network.",
    "long_description": "**Acerca de KnowAll AI**\n\nKnowAll AI es una empresa de tecnología especializada en soluciones innovadoras que mejoran las experiencias de soporte y servicio al cliente a través de integraciones de vanguardia.\n\n**Qué hace Zapdesk**\n\nZapdesk es una aplicación de barra lateral de Zendesk que permite a tus clientes mostrar aprecio por un soporte excepcional enviando propinas a los agentes a través de Bitcoin Lightning Network. Esta solución agnóstica de billetera proporciona una experiencia de propinas sin fricciones que beneficia tanto a los clientes como a los equipos de soporte.\n\n**Características principales:**\n\n- **Integración con Lightning Network**: Pagos de Bitcoin rápidos y de baja comisión utilizando direcciones Lightning\n- **Soporte de código QR**: Escaneo fácil con billeteras móviles utilizando protocolos BOLT11 y LNURL-pay\n- **Cantidades de propina configurables**: Valores de propina preestablecidos (100, 1.000, 10.000 sats) con soporte para cantidades personalizadas\n- **Mensajes personales**: Los clientes pueden incluir mensajes de agradecimiento con sus propinas\n- **Visibilidad flexible**: Los administradores controlan si las notificaciones de propinas aparecen como comentarios públicos o notas internas\n- **Sin custodia**: Los usuarios finales pagan directamente desde sus propias billeteras - Zapdesk nunca retiene fondos\n- **Control del agente**: Cada agente configura su propia dirección Lightning en su perfil de Zendesk\n\n**Privacidad y manejo de datos**\n\nZapdesk está comprometido con la protección de la privacidad del usuario y la seguridad de los datos:\n\n- **Sin recopilación de datos**: La aplicación no recopila, almacena ni transmite datos personales de clientes más allá de lo que ya está disponible en Zendesk\n- **Sin almacenamiento de datos financieros**: Las transacciones de pago ocurren directamente entre la billetera del cliente y la dirección Lightning del agente. Zapdesk no procesa, almacena ni tiene acceso a ninguna información de pago\n- **Zona de pruebas de Zendesk**: La aplicación se ejecuta completamente dentro de la zona de pruebas segura de iframe de Zendesk utilizando el marco ZAF v2\n- **Código abierto**: El código fuente completo está disponible en https://github.com/knowall-ai/zendesk-zapdesk para transparencia y revisión de seguridad\n- **Sin servicios externos**: La aplicación no se comunica con servidores externos ni servicios de terceros\n- **Permisos mínimos**: Solo accede a los datos necesarios de Zendesk (ID de ticket, asignado, usuario actual) a través del SDK oficial de ZAF",
    "installation_instructions": "**Requisitos previos**\n\nAntes de instalar Zapdesk, asegúrate de tener:\n\n1. Acceso de administrador a tu cuenta de Zendesk\n2. Direcciones de billetera de Lightning Network para los agentes que recibirán propinas\n\n**Pasos de instalación**\n\n**Paso 1: Crear campo de usuario personalizado**\n\n1. Navega a Centro de administración > Personas > Configuración > Campos de usuario (o visita https://TU_SUBDOMINIO.zendesk.com/admin/people/configuration/user_fields)\n2. Haz clic en **Agregar campo**\n3. Configura el campo:\n   - **Tipo**: Texto\n   - **Nombre para mostrar**: Lightning Address\n   - **Clave del campo**: lightning_address (debe ser exactamente esto)\n4. Haz clic en **Guardar**\n\n**Paso 2: Instalar la aplicación Zapdesk**\n\n1. Haz clic en **Instalar** para agregar Zapdesk a tu cuenta de Zendesk\n2. Durante la instalación, configura el ajuste de la aplicación:\n   - **Comentarios privados**: Marca esta casilla si deseas que las notificaciones de propinas aparezcan solo como notas internas. Desmarca para que sean comentarios públicos visibles para los clientes.\n3. Completa la instalación\n\n**Paso 3: Configurar direcciones Lightning de los agentes**\n\n1. Navega a Centro de administración > Personas > Equipo > Miembros del equipo (o visita https://TU_SUBDOMINIO.zendesk.com/admin/people/team/members)\n2. Para cada agente que deba recibir propinas:\n   - Haz clic en su nombre para abrir su perfil\n   - Haz clic en **Administrar en Support**\n   - Desplázate hacia abajo para encontrar el campo **Lightning Address**\n   - Ingresa la dirección de Lightning Network del agente (por ejemplo, agente@getalby.com)\n   - Haz clic en **Guardar**\n\n**Paso 4: Verificar instalación**\n\n1. Abre cualquier ticket de soporte\n2. Busca la aplicación **Zapdesk** en la barra lateral derecha\n3. Haz clic para expandirla\n4. La aplicación debería mostrar la información del agente asignado y las opciones de propina\n\n**Ubicación de configuración**\n\nDespués de la instalación, puedes modificar la configuración de la aplicación en:\n\nCentro de administración > Aplicaciones e integraciones > Aplicaciones de Zendesk Support > Zapdesk > Configuración\n\n**Soporte**\n\nPara obtener ayuda con la instalación, visita https://github.com/knowall-ai/zendesk-zapdesk"
  },
  "ui": {
    "loading": "Cargando…",
    "title": "Envía propina al agente instantáneamente con Bitcoin Lightning",
    "agent_subtitle": "Envía propina al agente con sats",
    "unassigned": "Sin asignar",
    "message_label": "Agregar un mensaje (opcional)",
    "message_placeholder": "¡Gracias por tu ayuda!",
    "mark_as_paid": "Marcar como pagado",
    "footer": "Este widget permite propinas de Bitcoin Lightning Network. Después de pagar a través del código QR, haz clic en Marcar como pagado para registrar la propina en este ticket.",
    "sats": "sats"
  },
  "errors": {
    "no_lightning_address": "No se encontró dirección Lightning para el agente.",
    "no_ticket_id": "ID de ticket no encontrado",
    "no_tip_amount": "No se seleccionó cantidad de propina",
    "failed_to_post": "Error al publicar el comentario en el ticket.",
    "failed_to_load": "Error al cargar información del agente."
  }
}
